import java.util.ArrayList;
import java.util.List;
import java.util.Random;

public class WordInitialization {
    public static String wordInit() {
//        List<String> ArrayList = new ArrayList<>(List.of(
//                "Олово", "Света"
//        ));

//        List<String> ArrayList = new ArrayList<>(List.of(
//                "Олово"
//        ));

        List<String> ArrayList = new ArrayList<>(List.of(
                "Шприц", "Слово", "Томат", "Шпала", "Плита", "Кант", "Хроника", "Зал", "Галера", "Балл", "Вес", "Кафель", "Знак", "Фильтр", "Башня",
                "Кондитер", "Омар", "Чан", "Пламя", "Банк", "Тетерев", "Муж", "Камбала", "Груз", "Кино", "Лаваш", "Калач", "Геолог", "Бальзам", "Бревно",
                "Жердь", "Борец", "Самовар", "Карабин", "Подлокотник", "Барак", "Мотор", "Шарж", "Сустав", "Амфитеатр", "Скворечник", "Подлодка", "Затычка",
                "Ресница", "Спичка", "Кабан", "Муфта", "Синоптик", "Характер", "Мафиози", "Фундамент", "Бумажник", "Библиофил", "Дрожжи", "Развлечение",
                "Конечность", "Пробор", "Дуст", "Комбинация", "Мешковина", "Процессор", "Крышка", "Сфинкс", "Пассатижи", "Фунт", "Кружево", "Агитатор",
                "Формуляр", "Прокол", "Абзац", "Караван", "Леденец", "Кашпо", "Баркас", "Кардан", "Вращение", "Заливное", "Метрдотель", "Клавиатура",
                "Радиатор", "Сегмент", "Обещание", "Магнитофон", "Кордебалет", "Заварушка"
        ));

        Random random = new Random();
        int randomIndex = random.nextInt(ArrayList.size());

        return ArrayList.get(randomIndex);
    }
}